In [1]:
# Importing Libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
# importing the dataset
df = pd.read_csv("/content/drive/MyDrive/Colab Notebooks/Customer_Prediction/BankCustomers.csv")

In [3]:
df.head()

   RowNumber  CustomerId   Surname  ...  IsActiveMember EstimatedSalary Exited
0          1    15634602  Hargrave  ...               1       101348.88      1
1          2    15647311      Hill  ...               1       112542.58      0
2          3    15619304      Onio  ...               0       113931.57      1
3          4    15701354      Boni  ...               0        93826.63      0
4          5    15737888  Mitchell  ...               1        79084.10      0

[5 rows x 14 columns]

In [4]:
df.shape

(10000, 14)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   Surname          10000 non-null  object
 3   CreditScore      10000 non-null  int64
 4   Geography        10000 non-null  object
 5   Gender           10000 non-null  object
 6   Age              10000 non-null  int64
 7   Tenure           10000 non-null  int64
 8   Balance          10000 non-null  float64
 9   NumOfProducts    10000 non-null  int64
 10  HasCrCard        10000 non-null  int64
 11  IsActiveMember   10000 non-null  int64
 12  EstimatedSalary  10000 non-null  float64
 13  Exited           10000 non-null  int64
dtypes: float64(2), int64(9), object(3)
memory usage: 1.1+ MB

In [6]:
df.Exited.value_counts()

0    7963
1    2037
Name: Exited, dtype: int64

In [7]:
df.isnull().sum()

RowNumber          0
CustomerId         0
Surname            0
CreditScore        0
Geography          0
Gender             0
Age                0
Tenure             0
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
EstimatedSalary    0
Exited             0
dtype: int64

In [8]:
df.drop(["RowNumber","CustomerId","Surname"],axis = 1, inplace = True)

In [9]:
df.columns

Index(['CreditScore', 'Geography', 'Gender', 'Age', 'Tenure', 'Balance',
       'NumOfProducts', 'HasCrCard', 'IsActiveMember', 'EstimatedSalary',
       'Exited'],
      dtype='object')

In [10]:
df.Geography.value_counts()

France     5014
Germany    2509
Spain      2477
Name: Geography, dtype: int64

In [11]:
df.Gender.value_counts()

Male      5457
Female    4543
Name: Gender, dtype: int64

In [12]:
# Convert Categorical feature in to dummy Variables
states = pd.get_dummies(df["Geography"], drop_first = True)
gender = pd.get_dummies(df["Gender"], drop_first = True)

In [13]:
df = pd.concat([df, states, gender], axis = 1)

In [14]:
df.drop(["Geography", "Gender"], axis =1, inplace = True)

In [15]:
df.head(1)

   CreditScore  Age  Tenure  Balance  ...  Exited  Germany  Spain  Male
0          619   42       2      0.0  ...       1        0      0     0

[1 rows x 12 columns]

In [16]:
df.columns

Index(['CreditScore', 'Age', 'Tenure', 'Balance', 'NumOfProducts', 'HasCrCard',
       'IsActiveMember', 'EstimatedSalary', 'Exited', 'Germany', 'Spain',
       'Male'],
      dtype='object')

In [17]:
X = df.loc[:,['CreditScore', 'Age', 'Tenure', 'Balance', 'NumOfProducts', 'HasCrCard','IsActiveMember', 'EstimatedSalary', 'Germany', 'Spain','Male']]
y = df.loc[:, "Exited"]

In [18]:
X.head(1)

   CreditScore  Age  Tenure  Balance  ...  EstimatedSalary  Germany  Spain  Male
0          619   42       2      0.0  ...        101348.88        0      0     0

[1 rows x 11 columns]

In [19]:
y.head(1)

0    1
Name: Exited, dtype: int64

In [20]:
# train test split
from sklearn.model_selection import train_test_split
X_train, X_test, y_train,y_test = train_test_split(X, y, test_size = 0.2, random_state = 0)

In [21]:
# Feature Scaling
from sklearn.preprocessing import StandardScaler
sc=StandardScaler()
X_train = sc.fit_transform(X_train)
X_test = sc.transform(X_test)

In [22]:
# Let's create the ANN Model
import keras
from keras.models import Sequential # to go through the layers sequentially
from keras.layers import Dense

In [23]:
# Initializing the ANN
classifier = Sequential()

In [24]:
# Adding the input layer and first Hidden Layer
classifier.add(Dense(activation="relu", input_dim = 11, units = 6,kernel_initializer= "uniform"))

# Adding the the second Hidden Layer
classifier.add(Dense(activation="relu", units = 6, kernel_initializer= "uniform"))


# Adding the output layer
classifier.add(Dense(activation = "sigmoid", units =1, kernel_initializer="uniform"))

In [25]:
classifier.summary()

Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense (Dense)                (None, 6)                 72
_________________________________________________________________
dense_1 (Dense)              (None, 6)                 42
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 7
=================================================================
Total params: 121
Trainable params: 121
Non-trainable params: 0
_________________________________________________________________

In [26]:
# Compiling the ANN
classifier.compile(optimizer='adam', loss= 'binary_crossentropy', metrics= ['accuracy'])

In [31]:
# Fitting the ANN to thee training set
classifier.fit(X_train, y_train, batch_size=200, epochs = 20)

Epoch 1/20
40/40 [==============================] - 0s 2ms/step - loss: 0.4190 - accuracy: 0.7960
Epoch 2/20
40/40 [==============================] - 0s 2ms/step - loss: 0.4184 - accuracy: 0.7960
Epoch 3/20
40/40 [==============================] - 0s 2ms/step - loss: 0.4181 - accuracy: 0.8019
Epoch 4/20
40/40 [==============================] - 0s 2ms/step - loss: 0.4177 - accuracy: 0.8189
Epoch 5/20
40/40 [==============================] - 0s 2ms/step - loss: 0.4174 - accuracy: 0.8198
Epoch 6/20
40/40 [==============================] - 0s 2ms/step - loss: 0.4171 - accuracy: 0.8207
Epoch 7/20
40/40 [==============================] - 0s 2ms/step - loss: 0.4168 - accuracy: 0.8213
Epoch 8/20
40/40 [==============================] - 0s 2ms/step - loss: 0.4165 - accuracy: 0.8210
Epoch 9/20
40/40 [==============================] - 0s 2ms/step - loss: 0.4161 - accuracy: 0.8230
Epoch 10/20
40/40 [==============================] - 0s 2ms/step - loss: 0.4159 - accuracy: 0.8230
Epoch 11/20
40/40 [==============================] - 0s 2ms/step - loss: 0.4154 - accuracy: 0.8238
Epoch 12/20
40/40 [==============================] - 0s 2ms/step - loss: 0.4153 - accuracy: 0.8256
Epoch 13/20
40/40 [==============================] - 0s 2ms/step - loss: 0.4148 - accuracy: 0.8246
Epoch 14/20
40/40 [==============================] - 0s 2ms/step - loss: 0.4144 - accuracy: 0.8269
Epoch 15/20
40/40 [==============================] - 0s 2ms/step - loss: 0.4141 - accuracy: 0.8269
Epoch 16/20
40/40 [==============================] - 0s 2ms/step - loss: 0.4139 - accuracy: 0.8284
Epoch 17/20
40/40 [==============================] - 0s 2ms/step - loss: 0.4136 - accuracy: 0.8288
Epoch 18/20
40/40 [==============================] - 0s 2ms/step - loss: 0.4132 - accuracy: 0.8292
Epoch 19/20
40/40 [==============================] - 0s 2ms/step - loss: 0.4131 - accuracy: 0.8286
Epoch 20/20
40/40 [==============================] - 0s 2ms/step - loss: 0.4130 - accuracy: 0.8304

In [32]:
# Making the Prediction and Evaluating the model
# Predicting the Test Set Results
y_pred = classifier.predict(X_test)
y_pred = (y_pred>0.5)

In [33]:
# Making the Confusion Matrix
from sklearn.metrics import confusion_matrix, accuracy_score
print("Confusion Matrix : ", confusion_matrix(y_test, y_pred))
print("Accuracy Score : ", accuracy_score(y_test, y_pred))

Confusion Matrix :  [[1573   22]
 [ 308   97]]
Accuracy Score :  0.835